ГТС/УТГТС/InformationRegisters/АналитикаУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУчетаНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяКалькуляции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюСписания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПоРНПТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>11</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюСписанияПоРНПТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>11</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремаркировкаТоваровГИСМ</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаАктивовПассивов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Первичное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПартияПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/ВариантыОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОбеспечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалитьОтгрузитьОбособленно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервироватьПоМереПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОбособленно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданРанее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТребуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/СтатусыВнутреннихЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыВнутреннихЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалитьКОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ВыборГруппыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВыборГруппыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запретить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешитьВЗаказах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешитьВЗаказахИНакладных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Catalogs/Назначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Назначения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНазначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНазначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаНазначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовНазначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвиженияПоСкладскимРегистрам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьТолькоНаличие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьСтавкиНДС</Name>
					<Comment>Формировать отчеты о закупках под принципала по ставкам НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/CommonModules/ПоступлениеТоваровНаСкладЛокализация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ Локализация


	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый документ.
//  Отказ - Булево - Признак проведения документа.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то проведение документа выполнено не будет.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то будет выполнен отказ от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект.
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//
Процедура ОбработкаУдаленияПроведения(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//  РежимЗаписи - РежимЗаписиДокумента - В параметр передается текущий режим записи документа. Позволяет определить в теле процедуры режим записи.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	ЗаполнитьЗначенияСвойств(Объект, ИнтеграцияГИСМ_УТ.ЗаполнитьПризнакиЕстьМаркируемаяПродукцияИЕстьКиЗ(Объект, "Товары"));

	//ASP_Dante 28/11/19
	Если Не Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ЕстьНазначение = Ложь;
		Для каждого Строка Из Объект.Товары Цикл
			Если ЗначениеЗаполнено(Строка.Назначение) Тогда
				Если Не ЕстьНазначение Тогда
					Объект.ДополнительныеСвойства.Вставить("Товары", Объект.Товары.Выгрузить(, "Номенклатура, Назначение, КодСтроки, Количество, ИдентификаторСтроки")); //+++ {{ ASP 01.02.2021 000009653 }} добавил ИдентификаторСтроки
					ЕстьНазначение = Истина;
				КонецЕсли; 
				Строка.ЗаказКлиента = Строка.Назначение.Заказ;
				Строка.Назначение = Справочники.Назначения.ПустаяСсылка();
				
			КонецЕсли;		
		КонецЦикла; 
		
		РаспоряжениеТребование = ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику");
		
		Если ЕстьНазначение И ЗначениеЗаполнено(Объект.Распоряжение) Тогда
			
			Если РаспоряжениеТребование Тогда
				ЗаказПоставщику = Объект.Распоряжение.ПолучитьОбъект();
				ПриобретениеТовара = НайтиПриобретениеПоТребованию(Объект.Распоряжение);
				Если ПриобретениеТовара.Количество() = 1 тогда
					ПриобретениеТовара = ПриобретениеТовара[0].ПолучитьОбъект();
				ИначеЕсли ПриобретениеТовара.Количество() = 0 Тогда
					Отказ = Истина; // Такой вариант по идее не должен быть, это некорректное поведение
				Иначе
					// пока такой вариант не обрабатываем
					Отказ = Истина;
				КонецЕсли;
			ИначеЕсли НЕ РаспоряжениеТребование и ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
				ЗаказПоставщику = Объект.Распоряжение.ЗаказПоставщика.ПолучитьОбъект();
				ПриобретениеТовара = Объект.Распоряжение.ПолучитьОбъект();
			Иначе
				Отказ = Истина; // значит какой-то иной вариант, который придется придумать как обработать
			КонецЕсли;
			
			МаксКодСтрокиВЗаказеПоставщику = ЗаказПоставщику.МаксимальныйКодСтроки;
			МаксКодСтрокиВЗаказеПоставщикуДубль = ЗаказПоставщику.МаксимальныйКодСтроки; // Для  приобретения товаров услуг
			Если МаксКодСтрокиВЗаказеПоставщику = 0 И ЗаказПоставщику.Товары.Количество() > 0 Тогда
				ВсеКодыСтрок = ЗаказПоставщику.Товары.Выгрузить( , "КодСтроки");
				ВсеКодыСтрок.Сортировать("КодСтроки");
				МаксКодСтрокиВЗаказеПоставщику = ВсеКодыСтрок[ВсеКодыСтрок.Количество() - 1].КодСтроки;
				МаксКодСтрокиВЗаказеПоставщикуДубль = ВсеКодыСтрок[ВсеКодыСтрок.Количество() - 1].КодСтроки;
			КонецЕсли;
			//--- {{ ASP 01.02.2021 000009653 }}
			
			#Область ОбработкаТаможеннойДекларации
			//++ASP_Crow 10.07.2024 000023822 Найдем таможенную декларацию если они есть
			ГТД = НайтиТаможеннуюДекларацию(ПриобретениеТовара.Ссылка);
			
			Если ГТД.Количество() = 1 тогда
				ГТД = ГТД[0].ПолучитьОбъект();
			ИначеЕсли ГТД.Количество() = 0 Тогда
				Отказ = Истина; // возможно, такое будет, надеюсь нет
			Иначе
				// пока такой вариант не обрабатываем
				Отказ = Истина;
			КонецЕсли; 
			
			//++ASP_СмирновН 11.12.24 000025496
			Если ГТД <> Неопределено Тогда
			ТоварыГТД = ГТД.Товары.Выгрузить();
			ГТД.Товары.Очистить();
			
			ПараметрыПоиска = новый Структура("Номенклатура, Назначение");
			Для каждого СтрГТД из ТоварыГТД Цикл
				
				Если ЗначениеЗаполнено(СтрГТД.Назначение) Тогда
					ПараметрыПоиска.Номенклатура = СтрГТД.Номенклатура;
					ПараметрыПоиска.Назначение = СтрГТД.Назначение; 
					
					МассивСтрок = Объект.ДополнительныеСвойства.Товары.НайтиСтроки(ПараметрыПоиска);
					Если МассивСтрок.Количество() = 0 Тогда
						ASP_ДобавитьСтрокуВГТД(ГТД, СтрГТД, Ложь);
					Иначе
						ОставшеесяКоличество = СтрГТД.Количество;
						ЭтоПервоеДобавлениеСтрокиВЗаказПоставщику = Истина;
						
						Для Каждого СтрокаПоступления Из МассивСтрок Цикл
							Если ОставшеесяКоличество = 0 Тогда
								Прервать;
							КонецЕсли;
							
							СтрокаЗаказа = ASP_ДобавитьСтрокуВГТД(ГТД, СтрГТД, Истина);
							
							Если ЭтоПервоеДобавлениеСтрокиВЗаказПоставщику Тогда
								ЭтоПервоеДобавлениеСтрокиВЗаказПоставщику = Ложь;
							Иначе
								МаксКодСтрокиВЗаказеПоставщикуДубль = МаксКодСтрокиВЗаказеПоставщикуДубль + 1;
								СтрокаЗаказа.КодСтроки = МаксКодСтрокиВЗаказеПоставщикуДубль;
								СтрокаПоступления.КодСтроки = МаксКодСтрокиВЗаказеПоставщикуДубль;
								Объект.Товары.Найти(СтрокаПоступления.ИдентификаторСтроки, "ИдентификаторСтроки").КодСтроки = МаксКодСтрокиВЗаказеПоставщикуДубль;
							КонецЕсли;
							
							Если ОставшеесяКоличество > СтрокаПоступления.Количество Тогда
								ТекущееКоличество = СтрокаПоступления.Количество;
							Иначе
								ТекущееКоличество = ОставшеесяКоличество;
							КонецЕсли;
							
							ОставшеесяКоличество = Макс(0, ОставшеесяКоличество - ТекущееКоличество);
							ASP_ОбработатьПриНеобходимостиИзменениеКоличества(ГТД, СтрокаЗаказа, ТекущееКоличество);
						КонецЦикла;
						
						Если ОставшеесяКоличество > 0 Тогда
							СтрокаЗаказа = ASP_ДобавитьСтрокуВГТД(ГТД, СтрГТД, Ложь);
							
							МаксКодСтрокиВЗаказеПоставщикуДубль = МаксКодСтрокиВЗаказеПоставщикуДубль + 1;
							СтрокаЗаказа.КодСтроки = МаксКодСтрокиВЗаказеПоставщикуДубль;
							
							ТекущееКоличество = ОставшеесяКоличество;
							
							ASP_ОбработатьПриНеобходимостиИзменениеКоличества(ГТД, СтрокаЗаказа, ТекущееКоличество);
						КонецЕсли;
					КонецЕсли;
					
				Иначе //Не ЗначениеЗаполнено(Строка.Назначение)
					
					СтрокаЗаказа = ГТД.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрГТД);
					
				КонецЕсли;
								
			КонецЦикла;
			
			Попытка
				ГТД.ДополнительныеСвойства.Вставить("ПропуститьПроверкуТоварыКОформлениюДокументовИмпорта", Истина);
				ГТД.ДополнительныеСвойства.Вставить("ПропуститьПерепроведениеПриобретений", Истина); //ASP_Crow 29.06.2026 000030362 ошибка двойного проведения
				ГТД.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Отказ = Истина;
				Сообщить("Не удалось провести ГТД " + ГТД);
			КонецПопытки;
			//++ASP_СмирновН 11.12.24 000025496
			Иначе
			КонецЕсли;
            //--ASP_СмирновН 11.12.24 000025496
			//--ASP_Crow 10.07.2024 000023822
			#КонецОбласти

			
			#Область ОбработкаПриобретения
	        ТоварыПТУ = ПриобретениеТовара.Товары.Выгрузить();
			ПриобретениеТовара.Товары.Очистить();
			
			ПараметрыПоиска = новый Структура("Номенклатура, Назначение");
			Для каждого СтрПТУ Из ТоварыПТУ Цикл

				Если ЗначениеЗаполнено(СтрПТУ.Назначение) Тогда
					
					ПараметрыПоиска.Номенклатура = СтрПТУ.Номенклатура;
					ПараметрыПоиска.Назначение = СтрПТУ.Назначение; 
					
					МассивСтрок = Объект.ДополнительныеСвойства.Товары.НайтиСтроки(ПараметрыПоиска);
					Если МассивСтрок.Количество() = 0 Тогда
						ASP_ДобавитьСтрокуВПриобретениеТоваров(ПриобретениеТовара, СтрПТУ, Ложь);
					Иначе
						ОставшеесяКоличество = СтрПТУ.Количество;
						ЭтоПервоеДобавлениеСтрокиВЗаказПоставщику = Истина;
						
						Для Каждого СтрокаПоступления Из МассивСтрок Цикл
							Если ОставшеесяКоличество = 0 Тогда
								Прервать;
							КонецЕсли;
							
							СтрокаЗаказа = ASP_ДобавитьСтрокуВПриобретениеТоваров(ПриобретениеТовара, СтрПТУ, Истина);
							
							Если ЭтоПервоеДобавлениеСтрокиВЗаказПоставщику Тогда
								ЭтоПервоеДобавлениеСтрокиВЗаказПоставщику = Ложь;
							Иначе
								МаксКодСтрокиВЗаказеПоставщикуДубль = МаксКодСтрокиВЗаказеПоставщикуДубль + 1;
								СтрокаЗаказа.КодСтроки = МаксКодСтрокиВЗаказеПоставщикуДубль;
								СтрокаПоступления.КодСтроки = МаксКодСтрокиВЗаказеПоставщикуДубль;
								Объект.Товары.Найти(СтрокаПоступления.ИдентификаторСтроки, "ИдентификаторСтроки").КодСтроки = МаксКодСтрокиВЗаказеПоставщикуДубль;
							КонецЕсли;
							
							Если ОставшеесяКоличество > СтрокаПоступления.Количество Тогда
								ТекущееКоличество = СтрокаПоступления.Количество;
							Иначе
								ТекущееКоличество = ОставшеесяКоличество;
							КонецЕсли;
							
							ОставшеесяКоличество = Макс(0, ОставшеесяКоличество - ТекущееКоличество);
							ASP_ОбработатьПриНеобходимостиИзменениеКоличества(ПриобретениеТовара, СтрокаЗаказа, ТекущееКоличество);
						КонецЦикла;
						
						Если ОставшеесяКоличество > 0 Тогда
							СтрокаЗаказа = ASP_ДобавитьСтрокуВПриобретениеТоваров(ПриобретениеТовара, СтрПТУ, Ложь);
							
							МаксКодСтрокиВЗаказеПоставщикуДубль = МаксКодСтрокиВЗаказеПоставщикуДубль + 1;
							СтрокаЗаказа.КодСтроки = МаксКодСтрокиВЗаказеПоставщикуДубль;
							
							ТекущееКоличество = ОставшеесяКоличество;
							
							ASP_ОбработатьПриНеобходимостиИзменениеКоличества(ПриобретениеТовара, СтрокаЗаказа, ТекущееКоличество);
						КонецЕсли;
					КонецЕсли;
					
				Иначе //Не ЗначениеЗаполнено(Строка.Назначение)
					
					СтрокаЗаказа = ПриобретениеТовара.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрПТУ);
					
				КонецЕсли;
				//--- {{ ASP 01.02.2021 000009653 }}
				
			КонецЦикла;
						
			Попытка
				ПриобретениеТовара.ДополнительныеСвойства.Вставить("ПропуститьПроверкуТоварыКОформлениюДокументовИмпорта", Истина);
				ПриобретениеТовара.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Отказ = Истина;
				Сообщить("Не удалось провести приобретение товаров услуг" + ПриобретениеТовара);
			КонецПопытки;
			#КонецОбласти
			
			#Область ОбработкаТребования
			Товары = ЗаказПоставщику.Товары.Выгрузить();
			ЗаказПоставщику.Товары.Очистить();
			
			ПараметрыПоиска = Новый Структура("Номенклатура, Назначение");
			Для каждого Строка Из Товары Цикл

				Если ЗначениеЗаполнено(Строка.Назначение) Тогда
					
					ПараметрыПоиска.Номенклатура = Строка.Номенклатура;
					ПараметрыПоиска.Назначение = Строка.Назначение; 
					
					МассивСтрок = Объект.ДополнительныеСвойства.Товары.НайтиСтроки(ПараметрыПоиска);
					Если МассивСтрок.Количество() = 0 Тогда
						ASP_ДобавитьСтрокуВЗаказПоставщику(ЗаказПоставщику, Строка, Истина); //ASP_Crow Проще будет перезаполнить полностью из-за кода строки
					Иначе
						ОставшеесяКоличество = Строка.Количество;
						ЭтоПервоеДобавлениеСтрокиВЗаказПоставщику = Истина;
						
						Для Каждого СтрокаПоступления Из МассивСтрок Цикл
							Если ОставшеесяКоличество = 0 Тогда
								Прервать;
							КонецЕсли;
							
							СтрокаЗаказа = ASP_ДобавитьСтрокуВЗаказПоставщику(ЗаказПоставщику, Строка, Истина);
							
							Если ЭтоПервоеДобавлениеСтрокиВЗаказПоставщику Тогда
								ЭтоПервоеДобавлениеСтрокиВЗаказПоставщику = Ложь;
							Иначе
								МаксКодСтрокиВЗаказеПоставщику = МаксКодСтрокиВЗаказеПоставщику + 1;
								СтрокаЗаказа.КодСтроки = МаксКодСтрокиВЗаказеПоставщику;
								СтрокаПоступления.КодСтроки = МаксКодСтрокиВЗаказеПоставщику;
								Объект.Товары.Найти(СтрокаПоступления.ИдентификаторСтроки, "ИдентификаторСтроки").КодСтроки = МаксКодСтрокиВЗаказеПоставщику;
							КонецЕсли;
							
							Если ОставшеесяКоличество > СтрокаПоступления.Количество Тогда
								ТекущееКоличество = СтрокаПоступления.Количество;
							Иначе
								ТекущееКоличество = ОставшеесяКоличество;
							КонецЕсли;
							
							ОставшеесяКоличество = Макс(0, ОставшеесяКоличество - ТекущееКоличество);
							ASP_ОбработатьПриНеобходимостиИзменениеКоличества(ЗаказПоставщику, СтрокаЗаказа, ТекущееКоличество);
						КонецЦикла;
						
						Если ОставшеесяКоличество > 0 Тогда
							СтрокаЗаказа = ASP_ДобавитьСтрокуВЗаказПоставщику(ЗаказПоставщику, Строка, Ложь);
							
							МаксКодСтрокиВЗаказеПоставщику = МаксКодСтрокиВЗаказеПоставщику + 1;
							СтрокаЗаказа.КодСтроки = МаксКодСтрокиВЗаказеПоставщику;
							
							ТекущееКоличество = ОставшеесяКоличество;
							
							ASP_ОбработатьПриНеобходимостиИзменениеКоличества(ЗаказПоставщику, СтрокаЗаказа, ТекущееКоличество);
						КонецЕсли;
					КонецЕсли;
					
				Иначе //Не ЗначениеЗаполнено(Строка.Назначение)
					
					СтрокаЗаказа = ЗаказПоставщику.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗаказа, Строка);
					
				КонецЕсли;
				//--- {{ ASP 01.02.2021 000009653 }}
				
			КонецЦикла;
			
			ЗаказПоставщику.МаксимальныйКодСтроки = МаксКодСтрокиВЗаказеПоставщику; //+++ {{ ASP 01.02.2021 000009653 }}
			
			Попытка
				ЗаказПоставщику.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Отказ = Истина;
				Сообщить("Не удалось провести заказ поставщику " + Объект.ЗаказПоставщику);
			КонецПопытки;
			#КонецОбласти
		КонецЕсли;
	КонецЕсли	
	////ASP_Dante 28/11/19
	
	
КонецПроцедуры

Процедура ASP_ОбработатьПриНеобходимостиИзменениеКоличества(Документ, СтрокаЗаказа, ТекущееКоличество)
	
	Если СтрокаЗаказа.Количество <> ТекущееКоличество Тогда
		СтрокаЗаказа.Количество = ТекущееКоличество;
		СтрокаЗаказа.КоличествоУпаковок = ТекущееКоличество;
		
		СтруктураДействий = Новый Структура;
		asp_ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Документ);	
	    ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаЗаказа, СтруктураДействий, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Процедура asp_ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект)
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	Если Не ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда 
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	КонецЕсли;
	
КонецПроцедуры

Функция ASP_ДобавитьСтрокуВПриобретениеТоваров(Приобретение, СтрокаТаблицыВыгруженнойИзТЧ, ОчиститьНазначение)
	
	СтрокаЗаказа = Приобретение.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрокаТаблицыВыгруженнойИзТЧ);
	
	Если ОчиститьНазначение И ЗначениеЗаполнено(СтрокаТаблицыВыгруженнойИзТЧ.Назначение) Тогда
		СтрокаЗаказа.ASP_ЗаказКлиента = СтрокаТаблицыВыгруженнойИзТЧ.Назначение.Заказ;
		СтрокаЗаказа.Назначение = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтрокаЗаказа;
	
КонецФункции

Функция ASP_ДобавитьСтрокуВЗаказПоставщику(ЗаказПоставщику, СтрокаТаблицыВыгруженнойИзТЧ, ОчиститьНазначение)
	
	СтрокаЗаказа = ЗаказПоставщику.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрокаТаблицыВыгруженнойИзТЧ);
	
	Если ОчиститьНазначение И ЗначениеЗаполнено(СтрокаТаблицыВыгруженнойИзТЧ.Назначение) Тогда
		СтрокаЗаказа.ASP_ЗаказКлиента = СтрокаТаблицыВыгруженнойИзТЧ.Назначение.Заказ;
		СтрокаЗаказа.Назначение = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтрокаЗаказа;
	
КонецФункции

Функция НайтиПриобретениеПоТребованию(Требование)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	               |ГДЕ
	               |	ПриобретениеТоваровУслуг.Проведен
	               |	И ПриобретениеТоваровУслуг.ЗаказПоставщику = &ЗаказПоставщику";
	Запрос.УстановитьПараметр("ЗаказПоставщику", Требование);
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез.ВыгрузитьКолонку("Ссылка");

КонецФункции // НайтиПриобретениеПоТребованию()

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина, то запись выполнена не будет и будет вызвано исключение.
//
Процедура ПриЗаписи(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  ОбъектКопирования - ДокументОбъект - Исходный документ, который является источником копирования.
//
Процедура ПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
КонецПроцедуры

// Добавляет команду создания документа "Авансовый отчет".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт


КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти


// Заполняет массив допустимых наименований входящих документов.
//
// Параметры:
//  МассивНаименований	 - Массив - массив наименования входящих документов.
//
Процедура ДополнитьНаименованияВходящихДокументов(МассивНаименований) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Процедура дополняет тексты запросов проведения документа.
//
// Параметры:
//  Запрос - Запрос - Общий запрос проведения документа.
//  ТекстыЗапроса - СписокЗначений - Список текстов запроса проведения.
//  Регистры - Строка, Структура - Список регистров проведения документа через запятую или в ключах структуры.
//
Процедура ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	//++ Локализация


	//-- Локализация
	
КонецПроцедуры
//++ Локализация
Процедура ASP_ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
	Движения = Объект.Движения;
	ДополнительныеСвойства = Объект.ДополнительныеСвойства;
	
	//++ASP_Crow 16.10.2024 000024647 массив для отправки уведомлений
	МассивЗаказовДляУведомлений = новый Массив;
	//--ASP_Crow 16.10.2024 000024647

	//++ Локализация
	//ASP_Dante 28/11/19
	Если Не Отказ И ДополнительныеСвойства.Свойство("Товары") Тогда
		ТоварыПоступления = ДополнительныеСвойства.Товары.Скопировать();
		ТоварыПоступления.Свернуть("Номенклатура, Назначение", "Количество");
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Назначения.Ссылка КАК Ссылка,
		|	Назначения.Заказ КАК Заказ
		|ИЗ
		|	Справочник.Назначения КАК Назначения
		|ГДЕ
		|	Назначения.Ссылка В(&Ссылка)
		|ИТОГИ ПО
		|	Заказ";
		
		Запрос.УстановитьПараметр("Ссылка", ТоварыПоступления.ВыгрузитьКолонку("Назначение"));
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Сообщить("Не найдено ни одного назначения!");
			Возврат;
		КонецЕсли;            
		ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ЕстьЗаказКлиента = Ложь;
		ТаблицаЗаказов = Документы.ЗаказКлиента.ПустаяСсылка().Товары.ВыгрузитьКолонки();
		ТаблицаЗаказов.Колонки.Добавить("ЗаказКлиента");
		ТаблицаЗаказов.Колонки.Добавить("КоличествоСписать");
		ТаблицаЗаказов.Колонки.Добавить("СкладОтправитель");
		
		Пока ВыборкаЗаказ.Следующий() Цикл
			
			ОбъектДокумент = ВыборкаЗаказ.Заказ.ПолучитьОбъект();
			ТоварыЗаказ = ОбъектДокумент.Товары;   		
			
			ВыборкаДетальныеЗаписи = ВыборкаЗаказ.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				МассивСтрок = ТоварыПоступления.НайтиСтроки(Новый Структура("Назначение", ВыборкаДетальныеЗаписи.Ссылка));
				Для каждого Строка Из МассивСтрок Цикл
					
					КоличествоСписать = Строка.Количество;
					Отбор = Новый Структура("Номенклатура, ВариантОбеспечения, Обособленно" + ?(ТипЗнч(ВыборкаДетальныеЗаписи.Заказ) = Тип("ДокументСсылка.ЗаказКлиента"), ", Склад", ""), Строка.Номенклатура, Перечисления.ВариантыОбеспечения.КОбеспечению, Истина, Объект.Склад);
					МассивСтрокЗаказ = ТоварыЗаказ.НайтиСтроки(Отбор);
					Для каждого СтрокаЗаказ Из МассивСтрокЗаказ Цикл
						
						Если КоличествоСписать = 0 Тогда
							Прервать;
						КонецЕсли;
						
						Списать = Мин(КоличествоСписать, СтрокаЗаказ.Количество);
						
						Если КоличествоСписать = СтрокаЗаказ.Количество Тогда
							СтрокаЗаказ.Обособленно = Ложь;
							СтрокаЗаказ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
							КоличествоСписать = 0;
							
						ИначеЕсли КоличествоСписать > СтрокаЗаказ.Количество Тогда
							СтрокаЗаказ.Обособленно = Ложь;	
							СтрокаЗаказ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
							КоличествоСписать = КоличествоСписать - СтрокаЗаказ.Количество;
							
						ИначеЕсли КоличествоСписать < СтрокаЗаказ.Количество Тогда
							
							НоваяСтрока = ТоварыЗаказ.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗаказ);
							НоваяСтрока.КодСтроки = ОбъектДокумент.МаксимальныйКодСтроки + 1;
							ОбъектДокумент.МаксимальныйКодСтроки = ОбъектДокумент.МаксимальныйКодСтроки + 1;
							
							СтрокаЗаказ.Обособленно = Ложь;
							СтрокаЗаказ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
							СтрокаЗаказ.Количество = Списать;
							СтрокаЗаказ.КоличествоУпаковок = Списать;
							
							НоваяСтрока.Количество = НоваяСтрока.Количество - Списать;
							НоваяСтрока.КоличествоУпаковок = НоваяСтрока.КоличествоУпаковок - Списать;
							
							Если ТипЗнч(ВыборкаДетальныеЗаписи.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
								СтруктураДействий = Новый Структура;
								asp_ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ОбъектДокумент);	
								
								ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаЗаказ, СтруктураДействий, Неопределено);							
								
								НоваяСтрока.Сумма = НоваяСтрока.Сумма - СтрокаЗаказ.Сумма;
								НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДС - СтрокаЗаказ.СуммаНДС;
								НоваяСтрока.СуммаСНДС = НоваяСтрока.СуммаСНДС - СтрокаЗаказ.СуммаСНДС;
								НоваяСтрока.СуммаРучнойСкидки = НоваяСтрока.СуммаРучнойСкидки - СтрокаЗаказ.СуммаРучнойСкидки;
								НоваяСтрока.СуммаАвтоматическойСкидки = НоваяСтрока.СуммаАвтоматическойСкидки - СтрокаЗаказ.СуммаАвтоматическойСкидки;
							КонецЕсли;
							
							КоличествоСписать = 0;
						КонецЕсли;
					КонецЦикла; 
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
						ЕстьЗаказКлиента = Истина;
						МассивСтрокЗаказ = ТоварыЗаказ.НайтиСтроки(Новый Структура("Номенклатура, ВариантОбеспечения, Обособленно", Строка.Номенклатура, Перечисления.ВариантыОбеспечения.КОбеспечению, Истина));
						Для каждого СтрокаЗаказ Из МассивСтрокЗаказ Цикл
							
							Если СтрокаЗаказ.Склад <> Объект.Склад И Не КоличествоСписать = 0 Тогда
								
								НоваяСтрока = ТаблицаЗаказов.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗаказ);
								
								НоваяСтрока.ЗаказКлиента = ВыборкаЗаказ.Заказ;
								
								Списать = Мин(КоличествоСписать, СтрокаЗаказ.Количество);
								
								Если Списать = СтрокаЗаказ.Количество Тогда
									
									КоличествоСписать = КоличествоСписать - Списать;
									
								ИначеЕсли Списать > СтрокаЗаказ.Количество Тогда
									
									Списать = Списать - СтрокаЗаказ.Количество;
									КоличествоСписать = КоличествоСписать - СтрокаЗаказ.Количество;
									
								ИначеЕсли Списать < СтрокаЗаказ.Количество Тогда								
									КоличествоСписать = 0;
								КонецЕсли;
								
								НоваяСтрока.КоличествоСписать = Списать;
								НоваяСтрока.СкладОтправитель = Объект.Склад;
								
								//ASP_Dante 18/02/20Сообщить("В строке "+СтрокаЗаказ.НомерСтроки+" отличается склад от заказа клиента");
								
								Продолжить;
								
							КонецЕсли;
							
						КонецЦикла;	
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		//ASP_Hlopkov 01.12.2020+
		//ПерезаписываласьАналитика = Ложь;
		//ASP_Hlopkov 01.12.2020-
		
		//++ASP_Crow 16.10.2024 000024647 Если будут создаваться перемещения, то обработка заказов пройдет в логике перемещений
		БудутСоздаватьсяПеремещения = ASP_СоздаватьЗаказыНаПеремещениеПриПроведении(Объект);                                    
		//--ASP_Crow 16.10.2024 000024647
		
		Если ЕстьЗаказКлиента Тогда
			
			//ASP_Hlopkov 20.08.2020+
			УстановитьПривилегированныйРежим(Истина);
			
			Для Каждого Товар Из Объект.Товары Цикл
				
				Если Товар.АналитикаУчетаНоменклатуры.Назначение <> Справочники.Назначения.ПустаяСсылка() Тогда
					
					АналитикаУчета = Товар.АналитикаУчетаНоменклатуры.ПолучитьОбъект();
					
					АналитикаУчета.Назначение = Справочники.Назначения.ПустаяСсылка();
					АналитикаУчета.Записать();
					//ASP_Hlopkov 01.12.2020+
					//ПерезаписываласьАналитика = Истина;
					//ASP_Hlopkov 01.12.2020-
				КонецЕсли;	
				
			КонецЦикла;	
			//ASP_Hlopkov 20.08.2020-
			
			Если ASP_СоздаватьЗаказыНаПеремещениеПриПроведении(Объект) Тогда //+++ {{ ASP 10.09.2020 000008403 }}
			
				//ASP_Hlopkov 13.02.2020+ Создаем перемещение
				ТаблицаСкладов = ТаблицаЗаказов.Скопировать(, "Склад");
				ТаблицаСкладов.Свернуть("Склад");
				
				Для каждого СтрокаСклад Из ТаблицаСкладов Цикл
					
					Перемещение = Документы.ЗаказНаПеремещение.СоздатьДокумент();
					Перемещение.ДокументОснование = Объект.Ссылка;
					Перемещение.Дата = ТекущаяДата();
					Перемещение.СкладОтправитель = Объект.Склад;
					Перемещение.СкладПолучатель = СтрокаСклад.Склад;
					Перемещение.Ответственный = Пользователи.ТекущийПользователь();
					Перемещение.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
					Перемещение.ВариантПриемкиТоваров = Объект.ВариантПриемкиТоваров;
					
					МассивЗаказов = ТаблицаЗаказов.НайтиСтроки(Новый Структура("Склад", СтрокаСклад.Склад));
					
					Для Каждого СтрокаЗаказ Из МассивЗаказов Цикл
						
						Если СтрокаЗаказ.КоличествоСписать = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						Списать = СтрокаЗаказ.КоличествоСписать;
						
						НовыйТовар = Перемещение.Товары.Добавить();
						НовыйТовар.Количество = Списать;
						НовыйТовар.КоличествоУпаковок = Списать;
						НовыйТовар.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
						НовыйТовар.НачалоОтгрузки = ТекущаяДата() + ((24*60*60)*3);
						НовыйТовар.Номенклатура = СтрокаЗаказ.Номенклатура;
						НовыйТовар.Назначение = Справочники.Назначения.НайтиПоРеквизиту("Заказ", СтрокаЗаказ.ЗаказКлиента); 
						Если ЗначениеЗаполнено(НовыйТовар.Назначение) и Перемещение.СкладОтправитель.ИспользоватьОрдернуюСхемуПриПоступлении Тогда
							НовыйТовар.Обособленно = Истина;
						КонецЕсли;
						
					КонецЦикла;
					Перемещение.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
					Перемещение.Организация = Объект.Организация;
					Перемещение.Подразделение = СтрокаЗаказ.ЗаказКлиента.Подразделение;
					Перемещение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
					Перемещение.СпособДоставки = СтрокаЗаказ.ЗаказКлиента.СпособДоставки;
					
					Попытка
						Перемещение.Записать(РежимЗаписиДокумента.Проведение);
						Сообщить("Записан и проведен документ "+Перемещение);
					Исключение
						Отказ = Истина;
						Сообщить("Не удалось провести заказ на перемещение!");
						Сообщить(ОписаниеОшибки());
					КонецПопытки; 
				КонецЦикла;
				//ASP_Hlopkov 13.02.2020-
				
			КонецЕсли; //Если ASP_СоздаватьЗаказыНаПеремещениеПриПроведении(Объект)
			
		КонецЕсли;
		
		ТоварыПоступления = ДополнительныеСвойства.Товары.Скопировать();
		ТоварыПоступления.Свернуть("Номенклатура, Назначение", "Количество");
		ВыборкаЗаказ.Сбросить();
		Пока ВыборкаЗаказ.Следующий() Цикл
			
			ОбъектДокумент = ВыборкаЗаказ.Заказ.ПолучитьОбъект();
			//++ASP_Crow 16.10.2024 000024647 Чтобы не дублировались уведомления 
			ОбъектДокумент.ДополнительныеСвойства.Вставить("ASP_ВнешнийДокумент");			
			//--ASP_Crow 16.10.2024 000024647
			ТоварыЗаказ = ОбъектДокумент.Товары;
			
			ВыборкаДетальныеЗаписи = ВыборкаЗаказ.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				МассивСтрок = ТоварыПоступления.НайтиСтроки(Новый Структура("Назначение", ВыборкаДетальныеЗаписи.Ссылка));
				Для каждого Строка Из МассивСтрок Цикл
					
					КоличествоСписать = Строка.Количество;
					
					МассивСтрокЗаказ = ТоварыЗаказ.НайтиСтроки(Новый Структура("Номенклатура, ВариантОбеспечения, Обособленно" + ?(ТипЗнч(ВыборкаДетальныеЗаписи.Заказ) = Тип("ДокументСсылка.ЗаказКлиента"), ", Склад", ""), Строка.Номенклатура, Перечисления.ВариантыОбеспечения.КОбеспечению,Истина, Объект.Склад));
					Для каждого СтрокаЗаказ Из МассивСтрокЗаказ Цикл
						
						Если КоличествоСписать = 0 Тогда
							Прервать;
						КонецЕсли;
						
						Списать = Мин(КоличествоСписать, СтрокаЗаказ.Количество);
						
						Если КоличествоСписать = СтрокаЗаказ.Количество Тогда
							
							СтрокаЗаказ.Обособленно = ЛОЖЬ;
							СтрокаЗаказ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
							КоличествоСписать = 0;
							
						ИначеЕсли КоличествоСписать > СтрокаЗаказ.Количество Тогда
							
							СтрокаЗаказ.Обособленно = ЛОЖЬ;
							СтрокаЗаказ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
							КоличествоСписать = КоличествоСписать - СтрокаЗаказ.Количество;
							
						ИначеЕсли КоличествоСписать < СтрокаЗаказ.Количество Тогда
							
							НоваяСтрока = ТоварыЗаказ.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗаказ);
							НоваяСтрока.КодСтроки = ОбъектДокумент.МаксимальныйКодСтроки + 1;
							ОбъектДокумент.МаксимальныйКодСтроки = ОбъектДокумент.МаксимальныйКодСтроки + 1;
							
							СтрокаЗаказ.Обособленно = ЛОЖЬ;
							СтрокаЗаказ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
							СтрокаЗаказ.Количество = Списать;
							СтрокаЗаказ.КоличествоУпаковок = Списать;
							НоваяСтрока.Количество = НоваяСтрока.Количество - Списать;
							НоваяСтрока.КоличествоУпаковок = НоваяСтрока.КоличествоУпаковок - Списать;
							
							Если ТипЗнч(ВыборкаДетальныеЗаписи.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
								СтруктураДействий = Новый Структура;
								asp_ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ОбъектДокумент);	
								
								ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаЗаказ, СтруктураДействий, Неопределено);
								
								НоваяСтрока.Сумма = НоваяСтрока.Сумма - СтрокаЗаказ.Сумма;
								НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДС - СтрокаЗаказ.СуммаНДС;
								НоваяСтрока.СуммаСНДС = НоваяСтрока.СуммаСНДС - СтрокаЗаказ.СуммаСНДС;
								НоваяСтрока.СуммаРучнойСкидки = НоваяСтрока.СуммаРучнойСкидки - СтрокаЗаказ.СуммаРучнойСкидки;
								НоваяСтрока.СуммаАвтоматическойСкидки = НоваяСтрока.СуммаАвтоматическойСкидки - СтрокаЗаказ.СуммаАвтоматическойСкидки;
							КонецЕсли;
							КоличествоСписать = 0;
						КонецЕсли;
					КонецЦикла;					
				КонецЦикла;
			КонецЦикла;
			Попытка
				ОбъектДокумент.Записать(РежимЗаписиДокумента.Проведение); 
				//++ASP_Crow 16.10.2024 000024647 Добавление заказов для создания уведомлений
				Если МассивЗаказовДляУведомлений.Найти(ОбъектДокумент) = Неопределено и не БудутСоздаватьсяПеремещения Тогда
					МассивЗаказовДляУведомлений.Добавить(ОбъектДокумент);
				КонецЕсли;
				//--ASP_Crow 16.10.2024 000024647
			Исключение
				Отказ = Истина;
				Сообщить("Не удалось провести документ заказ клиента " + ВыборкаЗаказ.Заказ);
			КонецПопытки;
		КонецЦикла;
		
		//++ASP_Crow 16.10.2024 000024647
		Если НЕ Отказ Тогда
			Для каждого Заказ Из МассивЗаказовДляУведомлений Цикл
				ASP_Добавленный.ASP_ДобавитьЗаписьСтатусаОбеспечения(Заказ.Ссылка);
			КонецЦикла;
		КонецЕсли;
        //--ASP_Crow 16.10.2024 000024647
		
		//ASP_Hlopkov 01.12.2020+ нужно перезаполнить ключи аналитики, иначе образуются отриц остатки по товарам организаций 
		//Если ПерезаписываласьАналитика Тогда
			МестаУчета = РегистрыСведений.АналитикаУчетаНоменклатуры.МестаУчета(
					Объект.ХозяйственнаяОперация,
					Объект.Склад,
					Объект.Подразделение,
					Объект.Партнер,
					Объект.Договор);
					
			МассивОперацийВПутиИФактуровка = Новый Массив;
			МассивОперацийВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути);
			МассивОперацийВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути);
			МассивОперацийВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути);
			МассивОперацийВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки);
			МассивОперацийВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки);
			// Если Склад - группа, то для аналитики учета номенклатуры склад берем из ТЧ
			ИменаПолей = РегистрыСведений.АналитикаУчетаНоменклатуры.ИменаПолейКоллекцииПоУмолчанию();
			Если Объект.Склад.ЭтоГруппа И Объект.Склад.ВыборГруппы = Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказахИНакладных
			 И МассивОперацийВПутиИФактуровка.Найти(Объект.ХозяйственнаяОперация) = Неопределено Тогда
				ИменаПолей.Вставить("Произвольный", "Склад");
			КонецЕсли;
			
			ИменаПолей.Вставить("Работа");
			
			РегистрыСведений.АналитикаУчетаНоменклатуры.ЗаполнитьВКоллекции(
				Объект.Товары,
				МестаУчета,
				ИменаПолей);
		//КонецЕсли;		
		//ASP_Hlopkov 01.12.2020-
		//ASP_Hlopkov 03.12.2020+ Также нужно перезаполнить аналитику в движениях
		НаборЗаписей = РегистрыНакопления.ТоварыОрганизаций.СоздатьНаборЗаписей();
			
		НаборЗаписей.Отбор.Регистратор.Установить(Объект.Ссылка);
		НаборЗаписей.Прочитать();
		счНабор = 0; //Yulia 22/01/2021 добавлена провера на услуги, иначе происходила данные не сходятся с регистром Товары организаций	
		Если НаборЗаписей.Количество() > 0 Тогда
			Для Каждого Товар Из Объект.Товары Цикл
				//1 если услуга, то продолжить
				Если Товар.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
					Продолжить;
				КонецЕсли;	
				СтрокаКопии = Объект.Ссылка.Товары[Товар.НомерСтроки - 1];
				///НайденнаяЗапись = НаборЗаписей[Товар.НомерСтроки - 1];
				//2+пров на счн и кол в наборе
				Если НаборЗаписей.Количество() >= счНабор Тогда
					НайденнаяЗапись = НаборЗаписей[счНабор];
					НайденнаяЗапись.АналитикаУчетаНоменклатуры = Товар.АналитикаУчетаНоменклатуры;	
					счНабор = счНабор + 1
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		НаборЗаписей.Записать(Истина);
		//ASP_Hlopkov 03.12.2020-
		
	КонецЕсли;
	//ASP_Dante 28/11/19
	//-- Локализация

КонецПроцедуры

Функция ASP_СоздаватьЗаказыНаПеремещениеПриПроведении(ПриобретениеТоваровУслугОбъект)
	
	Если Не ПриобретениеТоваровУслугОбъект.ДополнительныеСвойства.Свойство("ЗаписьИзФормы")
	 Или ПриобретениеТоваровУслугОбъект.ДополнительныеСвойства.ЗаписьИзФормы <> "ФормаДокумента" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(ПриобретениеТоваровУслугТовары.Ссылка.ЗаказПоставщику.НомерПоДаннымПоставщика, """")
		|		ИНАЧЕ ПриобретениеТоваровУслугТовары.ЗаказПоставщику.НомерПоДаннымПоставщика
		|	КОНЕЦ КАК ВходящийНомерЗаказПоставщика
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|ГДЕ
		|	ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ПриобретениеТоваровУслугОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ПустаяСтрока(Выборка.ВходящийНомерЗаказПоставщика) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	
	Возврат Истина;
	
КонецФункции

Функция ASP_ДобавитьСтрокуВГТД(ГТД, СтрокаТаблицыВыгруженнойИзТЧ, ОчиститьНазначение)
	
	СтрокаЗаказа = ГТД.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрокаТаблицыВыгруженнойИзТЧ);
	
	Если ОчиститьНазначение И ЗначениеЗаполнено(СтрокаТаблицыВыгруженнойИзТЧ.Назначение) Тогда
		//СтрокаЗаказа.ASP_ЗаказКлиента = СтрокаТаблицыВыгруженнойИзТЧ.Назначение.Заказ;
		СтрокаЗаказа.Назначение = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтрокаЗаказа;
	
КонецФункции

Функция НайтиТаможеннуюДекларацию(Поступление)

	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаможеннаяДекларацияИмпортТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаможеннаяДекларацияИмпортТовары
	               |ГДЕ
	               |	ТаможеннаяДекларацияИмпортТовары.ДокументПоступления = &Поступление
	               |	И ТаможеннаяДекларацияИмпортТовары.Ссылка.Проведен";
	Запрос.УстановитьПараметр("Поступление", Поступление);
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез.ВыгрузитьКолонку("Ссылка");
	
	
КонецФункции

//-- Локализация

#КонецОбласти

#КонецОбласти
